---
kind: property
id: P:Autodesk.Revit.DB.Analysis.MEPAnalyticalSegment.InnerDiameter
source: html/f0553bf0-81ee-1cec-f216-4f8beddb1dbf.htm
---
# Autodesk.Revit.DB.Analysis.MEPAnalyticalSegment.InnerDiameter Property

The inner diameter of this segment, in ft. For rectangular or oval profile, this may be the hydraulic diameter.

## Syntax (C#)
```csharp
public double InnerDiameter { get; }
```